CSI API ETABS v1
cDesignSteel.AISC360_22 Property
 AISC 360-22 steel design code.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cDStAISC360_22 AISC360_22 { get; }
ReadOnly Property AISC360_22 As cDStAISC360_22
	Get
Dim instance As cDesignSteel
Dim value As cDStAISC360_22
value = instance.AISC360_22
property cDStAISC360_22^ AISC360_22 {
	cDStAISC360_22^ get ();
}
abstract AISC360_22 : cDStAISC360_22 with get
Return Value
Type: cDStAISC360_22
AISC 360-22 steel design code.
Remarks
Added in v1.31.
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace